#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-LMbCVJXUdygajGNd" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-LMbCVJXUdygajGNd

Waiting for the plan to start...

Terraform v1.13.5
on linux_amd64
Initializing plugins and modules...
github_repository.cdktf-provider-null-go_repo_4557B6A4: Refreshing state... [id=cdktf-provider-null-go]
github_repository.cdktf-provider-kubernetes-go_repo_6F3DC702: Refreshing state... [id=cdktf-provider-kubernetes-go]
github_repository.cdktf-provider-random_repo_7F3451CC: Refreshing state... [id=cdktf-provider-random]
github_repository.cdktf-repository-manager_repo_7A9025CB: Refreshing state... [id=cdktf-repository-manager]
github_repository.cdktf-provider-project_repo_E3143137: Refreshing state... [id=cdktf-provider-project]
github_repository.cdktf-provider-random-go_repo_19C9273C: Refreshing state... [id=cdktf-provider-random-go]
github_repository.cdktf-provider-google_repo_CE4ACC96: Refreshing state... [id=cdktf-provider-google]
github_repository.cdktf-provider-vault-go_repo_804CC4FA: Refreshing state... [id=cdktf-provider-vault-go]
github_repository.cdktf-provider-kubernetes_repo_4B9B31BD: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.cdktf-provider-aws-go_repo_F8360824: Refreshing state... [id=cdktf-provider-aws-go]
github_repository.cdktf-provider-tfe_repo_0CC81E0A: Refreshing state... [id=cdktf-provider-tfe]
github_repository.cdktf-provider-azurerm_repo_435D2650: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.cdktf-provider-github_repo_62CAA301: Refreshing state... [id=cdktf-provider-github]
github_repository.cdktf-provider-aws_repo_AA8B0A83: Refreshing state... [id=cdktf-provider-aws]
github_repository.cdktf-provider-datadog-go_repo_94066CBA: Refreshing state... [id=cdktf-provider-datadog-go]
github_repository.cdktf-provider-googlebeta_repo_85C9F4DF: Refreshing state... [id=cdktf-provider-googlebeta]
github_repository.cdktf-provider-tfe-go_repo_A2CDA646: Refreshing state... [id=cdktf-provider-tfe-go]
github_repository.cdktf-provider-googlebeta-go_repo_5445CBEF: Refreshing state... [id=cdktf-provider-googlebeta-go]
github_repository.cdktf-provider-github-go_repo_30BC68AA: Refreshing state... [id=cdktf-provider-github-go]
data.github_team.cdktf-team-cdktf: Reading...
github_repository.cdktf-provider-google-go_repo_890261D7: Refreshing state... [id=cdktf-provider-google-go]
github_repository.cdktf-provider-datadog_repo_62519FF4: Refreshing state... [id=cdktf-provider-datadog]
github_repository.cdktf-provider-null_repo_11F23BAB: Refreshing state... [id=cdktf-provider-null]
github_repository.cdktf-provider-azurerm-go_repo_9A4A2879: Refreshing state... [id=cdktf-provider-azurerm-go]
github_repository.cdktf-provider-vault_repo_93B87868: Refreshing state... [id=cdktf-provider-vault]
github_issue_label.cdktf-provider-kubernetes-go_repository-setup_auto-approve-label_E27D905B: Refreshing state... [id=cdktf-provider-kubernetes-go:auto-approve]
github_issue_label.cdktf-provider-kubernetes-go_repository-setup_automerge-label_B3F8F10F: Refreshing state... [id=cdktf-provider-kubernetes-go:automerge]
github_issue_label.cdktf-provider-kubernetes-go_repository-setup_no-auto-close-label_2C61AC4A: Refreshing state... [id=cdktf-provider-kubernetes-go:no-auto-close]
github_repository_webhook.cdktf-provider-kubernetes-go_repository-setup_slack-webhook_06EFA512: Refreshing state... [id=387362970]
github_repository_webhook.cdktf-provider-null-go_repository-setup_slack-webhook_72418AB6: Refreshing state... [id=387362411]
github_issue_label.cdktf-provider-null-go_repository-setup_automerge-label_2A18AAC3: Refreshing state... [id=cdktf-provider-null-go:automerge]
github_issue_label.cdktf-provider-null-go_repository-setup_auto-approve-label_8C386D2C: Refreshing state... [id=cdktf-provider-null-go:auto-approve]
github_issue_label.cdktf-provider-null-go_repository-setup_no-auto-close-label_74BA5497: Refreshing state... [id=cdktf-provider-null-go:no-auto-close]
github_branch_protection.cdktf-provider-random_repository-setup_main-protection_F6F3AEAB: Refreshing state... [id=BPR_kwDOF5QYes4B070V]
github_actions_secret.cdktf-provider-random_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D33B0F83: Refreshing state... [id=cdktf-provider-random:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-random_repo_secret-maven-staging-profile-id_FC01E031: Refreshing state... [id=cdktf-provider-random:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-random_repo_secret-maven-password_F1C6A7AB: Refreshing state... [id=cdktf-provider-random:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-random_repo_secret-maven-gpg-private-key_3ED8E2E5: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-random_repo_secret-alert-prs-slack-webhook-url_5178BF98: Refreshing state... [id=cdktf-provider-random:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-random_repo_secret-twine-password_17FC82E9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-random_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_A405718A: Refreshing state... [id=cdktf-provider-random:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-random_repo_secret-maven-username_26FBCE24: Refreshing state... [id=cdktf-provider-random:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-random_repo_secret-npm-token_335C520B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.cdktf-provider-random_repo_secret-gh-token_E5FB42F2: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_issue_label.cdktf-provider-random_repository-setup_automerge-label_743093E4: Refreshing state... [id=cdktf-provider-random:automerge]
github_repository_dependabot_security_updates.cdktf-provider-random_dependabot-security_A10FB82C: Refreshing state... [id=cdktf-provider-random]
github_issue_label.cdktf-provider-random_repository-setup_auto-approve-label_C02B56B6: Refreshing state... [id=cdktf-provider-random:auto-approve]
data.github_team.cdktf-team-cdktf: Read complete after 8s [id=6602018]
github_actions_secret.cdktf-provider-random_repo_secret-maven-gpg-private-key-passphrase_4BF68A82: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-random_repository-setup_no-auto-close-label_7A609959: Refreshing state... [id=cdktf-provider-random:no-auto-close]
github_repository_webhook.cdktf-provider-random_repository-setup_slack-webhook_41E45310: Refreshing state... [id=387362765]
github_actions_secret.cdktf-provider-random_repo_secret-twine-username_7CBD0EC4: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.cdktf-provider-random_repo_secret-nuget-api-key_B34F9280: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_issue_label.cdktf-provider-project_repository-setup_automerge-label_357D6B30: Refreshing state... [id=cdktf-provider-project:automerge]
github_branch_protection.cdktf-provider-project_repository-setup_main-protection_5654EA8C: Refreshing state... [id=BPR_kwDOERSies4DF-qA]
github_repository_dependabot_security_updates.cdktf-provider-project_dependabot-security_0CD638FF: Refreshing state... [id=cdktf-provider-project]
github_issue_label.cdktf-provider-project_repository-setup_no-auto-close-label_3E60A48E: Refreshing state... [id=cdktf-provider-project:no-auto-close]
github_repository_webhook.cdktf-provider-project_repository-setup_slack-webhook_5D2C2186: Refreshing state... [id=387362862]
github_issue_label.cdktf-provider-project_repository-setup_auto-approve-label_A1B2ECAC: Refreshing state... [id=cdktf-provider-project:auto-approve]
github_actions_secret.cdktf-provider-project_repo_secret-npm-token_56C6207A: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_issue_label.cdktf-provider-random-go_repository-setup_auto-approve-label_EE973476: Refreshing state... [id=cdktf-provider-random-go:auto-approve]
github_issue_label.cdktf-provider-random-go_repository-setup_automerge-label_028B931C: Refreshing state... [id=cdktf-provider-random-go:automerge]
github_issue_label.cdktf-provider-random-go_repository-setup_no-auto-close-label_35A43549: Refreshing state... [id=cdktf-provider-random-go:no-auto-close]
github_repository_webhook.cdktf-provider-random-go_repository-setup_slack-webhook_993E8760: Refreshing state... [id=387362232]
github_actions_secret.cdktf-provider-google_repo_secret-maven-username_74954783: Refreshing state... [id=cdktf-provider-google:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-google_repo_secret-alert-prs-slack-webhook-url_DD9AE967: Refreshing state... [id=cdktf-provider-google:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-google_repo_secret-maven-staging-profile-id_551C7805: Refreshing state... [id=cdktf-provider-google:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-google_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3986159A: Refreshing state... [id=cdktf-provider-google:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-google_repo_secret-npm-token_B51D663A: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.cdktf-provider-google_repo_secret-maven-password_CF4CD81F: Refreshing state... [id=cdktf-provider-google:MAVEN_PASSWORD]
github_repository_dependabot_security_updates.cdktf-provider-google_dependabot-security_7145EB4F: Refreshing state... [id=cdktf-provider-google]
github_actions_secret.cdktf-provider-google_repo_secret-maven-gpg-private-key-passphrase_5C4B770B: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-google_repo_secret-maven-gpg-private-key_3134B485: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.cdktf-provider-google_repository-setup_no-auto-close-label_8F127D28: Refreshing state... [id=cdktf-provider-google:no-auto-close]
github_repository_webhook.cdktf-provider-google_repository-setup_slack-webhook_32D643CB: Refreshing state... [id=387362669]
github_actions_secret.cdktf-provider-google_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3C47BF10: Refreshing state... [id=cdktf-provider-google:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-google_repo_secret-nuget-api-key_28AB2AB3: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.cdktf-provider-google_repo_secret-twine-username_2771C9DA: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_issue_label.cdktf-provider-google_repository-setup_auto-approve-label_7151E72D: Refreshing state... [id=cdktf-provider-google:auto-approve]
github_actions_secret.cdktf-provider-google_repo_secret-gh-token_71EB8F5C: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.cdktf-provider-google_repo_secret-twine-password_95B8E6EB: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_branch_protection.cdktf-provider-google_repository-setup_main-protection_A1D92C4B: Refreshing state... [id=BPR_kwDOERTEdc4B07uR]
github_issue_label.cdktf-provider-google_repository-setup_automerge-label_434F142B: Refreshing state... [id=cdktf-provider-google:automerge]
github_actions_secret.cdktf-repository-manager_repo_secret-gh-comment-token_D52FE846: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_issue_label.cdktf-repository-manager_repository-setup_no-auto-close-label_957998F8: Refreshing state... [id=cdktf-repository-manager:no-auto-close]
github_repository_dependabot_security_updates.cdktf-repository-manager_dependabot-security_C42FCEBA: Refreshing state... [id=cdktf-repository-manager]
github_actions_secret.cdktf-repository-manager_repo_secret-tf-cloud-token_8963D366: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_issue_label.cdktf-repository-manager_repository-setup_auto-approve-label_F8DAAE17: Refreshing state... [id=cdktf-repository-manager:auto-approve]
github_issue_label.cdktf-repository-manager_repository-setup_automerge-label_05B78AA6: Refreshing state... [id=cdktf-repository-manager:automerge]
github_repository_webhook.cdktf-repository-manager_repository-setup_slack-webhook_2C910A6F: Refreshing state... [id=387362518]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-npm-token_B789B6E1: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-gh-token_653A48E6: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-maven-gpg-private-key_D039BA1E: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY]
github_repository_webhook.cdktf-provider-kubernetes_repository-setup_slack-webhook_785CB176: Refreshing state... [id=387362980]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-maven-username_DFDFBB6A: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-twine-username_7BB86844: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-twine-password_18C9E0F1: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-maven-gpg-private-key-passphrase_244955D0: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-maven-password_472CD162: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-kubernetes_repository-setup_automerge-label_FDF3FF38: Refreshing state... [id=cdktf-provider-kubernetes:automerge]
github_issue_label.cdktf-provider-kubernetes_repository-setup_no-auto-close-label_8035ABFF: Refreshing state... [id=cdktf-provider-kubernetes:no-auto-close]
github_repository_dependabot_security_updates.cdktf-provider-kubernetes_dependabot-security_84B90445: Refreshing state... [id=cdktf-provider-kubernetes]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_64B7238E: Refreshing state... [id=cdktf-provider-kubernetes:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-alert-prs-slack-webhook-url_42B8F35A: Refreshing state... [id=cdktf-provider-kubernetes:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-maven-staging-profile-id_17C059DE: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_STAGING_PROFILE_ID]
github_issue_label.cdktf-provider-kubernetes_repository-setup_auto-approve-label_2D557777: Refreshing state... [id=cdktf-provider-kubernetes:auto-approve]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5BCC5730: Refreshing state... [id=cdktf-provider-kubernetes:PROJEN_GITHUB_TOKEN]
github_branch_protection.cdktf-provider-kubernetes_repository-setup_main-protection_4C343F8F: Refreshing state... [id=BPR_kwDOERTQSc4B071B]
github_actions_secret.cdktf-provider-kubernetes_repo_secret-nuget-api-key_4D361A62: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_issue_label.cdktf-provider-vault-go_repository-setup_automerge-label_A2907056: Refreshing state... [id=cdktf-provider-vault-go:automerge]
github_issue_label.cdktf-provider-vault-go_repository-setup_auto-approve-label_DCFB19E5: Refreshing state... [id=cdktf-provider-vault-go:auto-approve]
github_repository_webhook.cdktf-provider-vault-go_repository-setup_slack-webhook_67793D0B: Refreshing state... [id=387362331]
github_issue_label.cdktf-provider-vault-go_repository-setup_no-auto-close-label_498BDE4E: Refreshing state... [id=cdktf-provider-vault-go:no-auto-close]
github_issue_label.cdktf-provider-aws-go_repository-setup_automerge-label_C4C465BC: Refreshing state... [id=cdktf-provider-aws-go:automerge]
github_issue_label.cdktf-provider-aws-go_repository-setup_no-auto-close-label_F27239C6: Refreshing state... [id=cdktf-provider-aws-go:no-auto-close]
github_issue_label.cdktf-provider-aws-go_repository-setup_auto-approve-label_872BDB1D: Refreshing state... [id=cdktf-provider-aws-go:auto-approve]
github_repository_webhook.cdktf-provider-aws-go_repository-setup_slack-webhook_668A3867: Refreshing state... [id=387362315]
github_issue_label.cdktf-provider-tfe_repository-setup_auto-approve-label_71077F85: Refreshing state... [id=cdktf-provider-tfe:auto-approve]
github_actions_secret.cdktf-provider-tfe_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_97D02F32: Refreshing state... [id=cdktf-provider-tfe:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-tfe_repo_secret-maven-staging-profile-id_2BBFAE7E: Refreshing state... [id=cdktf-provider-tfe:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-tfe_repo_secret-maven-username_285332B3: Refreshing state... [id=cdktf-provider-tfe:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-tfe_repo_secret-twine-password_9C4E5F9B: Refreshing state... [id=cdktf-provider-tfe:TWINE_PASSWORD]
github_issue_label.cdktf-provider-tfe_repository-setup_no-auto-close-label_8FC910E5: Refreshing state... [id=cdktf-provider-tfe:no-auto-close]
github_actions_secret.cdktf-provider-tfe_repo_secret-twine-username_58E6966B: Refreshing state... [id=cdktf-provider-tfe:TWINE_USERNAME]
github_branch_protection.cdktf-provider-tfe_repository-setup_main-protection_8D678383: Refreshing state... [id=BPR_kwDOGgyoys4B07wC]
github_repository_webhook.cdktf-provider-tfe_repository-setup_slack-webhook_2502A4A4: Refreshing state... [id=387362355]
github_actions_secret.cdktf-provider-tfe_repo_secret-nuget-api-key_3E194AB0: Refreshing state... [id=cdktf-provider-tfe:NUGET_API_KEY]
github_actions_secret.cdktf-provider-tfe_repo_secret-maven-password_067420B0: Refreshing state... [id=cdktf-provider-tfe:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-tfe_repository-setup_automerge-label_0406E560: Refreshing state... [id=cdktf-provider-tfe:automerge]
github_actions_secret.cdktf-provider-tfe_repo_secret-npm-token_7ACE03F9: Refreshing state... [id=cdktf-provider-tfe:NPM_TOKEN]
github_actions_secret.cdktf-provider-tfe_repo_secret-maven-gpg-private-key_439DA59B: Refreshing state... [id=cdktf-provider-tfe:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-tfe_repo_secret-maven-gpg-private-key-passphrase_847A37E3: Refreshing state... [id=cdktf-provider-tfe:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-tfe_repo_secret-gh-token_E44D131B: Refreshing state... [id=cdktf-provider-tfe:GH_TOKEN]
github_actions_secret.cdktf-provider-tfe_repo_secret-alert-prs-slack-webhook-url_746ADFC6: Refreshing state... [id=cdktf-provider-tfe:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-tfe_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_0A1C1EBC: Refreshing state... [id=cdktf-provider-tfe:GO_GITHUB_TOKEN]
github_repository_dependabot_security_updates.cdktf-provider-tfe_dependabot-security_699DF1FA: Refreshing state... [id=cdktf-provider-tfe]
github_actions_secret.cdktf-provider-azurerm_repo_secret-nuget-api-key_B379FCE6: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_issue_label.cdktf-provider-azurerm_repository-setup_automerge-label_F1A196DC: Refreshing state... [id=cdktf-provider-azurerm:automerge]
github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-password_E040DE4B: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_PASSWORD]
github_repository_dependabot_security_updates.cdktf-provider-azurerm_dependabot-security_6F765105: Refreshing state... [id=cdktf-provider-azurerm]
github_actions_secret.cdktf-provider-azurerm_repo_secret-npm-token_504E009A: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token_B9F04536: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-gpg-private-key_20A9A492: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY]
github_branch_protection.cdktf-provider-azurerm_repository-setup_main-protection_25FF1006: Refreshing state... [id=BPR_kwDOERTEbc4B07wG]
github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-staging-profile-id_577F09F8: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_STAGING_PROFILE_ID]
github_issue_label.cdktf-provider-azurerm_repository-setup_no-auto-close-label_20DEA19F: Refreshing state... [id=cdktf-provider-azurerm:no-auto-close]
github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F37B6293: Refreshing state... [id=cdktf-provider-azurerm:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-azurerm_repo_secret-twine-username_7037FAE3: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.cdktf-provider-azurerm_repo_secret-twine-password_3D259DCA: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-gpg-private-key-passphrase_2A5862C8: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-azurerm_repository-setup_auto-approve-label_A1E7088B: Refreshing state... [id=cdktf-provider-azurerm:auto-approve]
github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-username_005A8995: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_76F8529C: Refreshing state... [id=cdktf-provider-azurerm:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_webhook.cdktf-provider-azurerm_repository-setup_slack-webhook_31692033: Refreshing state... [id=387362843]
github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_490AF334: Refreshing state... [id=cdktf-provider-azurerm:GO_GITHUB_TOKEN]
github_branch_protection.cdktf-provider-github_repository-setup_main-protection_E389780F: Refreshing state... [id=BPR_kwDOERTQWc4B07xC]
github_actions_secret.cdktf-provider-github_repo_secret-gh-token_C6814D8A: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_issue_label.cdktf-provider-github_repository-setup_no-auto-close-label_3D70DA4D: Refreshing state... [id=cdktf-provider-github:no-auto-close]
github_issue_label.cdktf-provider-github_repository-setup_auto-approve-label_0F631DE0: Refreshing state... [id=cdktf-provider-github:auto-approve]
github_repository_webhook.cdktf-provider-github_repository-setup_slack-webhook_8E87D5C6: Refreshing state... [id=387362194]
github_actions_secret.cdktf-provider-github_repo_secret-twine-password_D27FC950: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-github_repo_secret-alert-prs-slack-webhook-url_9FBDBDCF: Refreshing state... [id=cdktf-provider-github:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-github_repo_secret-maven-username_80741863: Refreshing state... [id=cdktf-provider-github:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-github_repo_secret-maven-staging-profile-id_868449FA: Refreshing state... [id=cdktf-provider-github:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-github_repo_secret-npm-token_3D74582B: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.cdktf-provider-github_repo_secret-nuget-api-key_DBBBAA3C: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.cdktf-provider-github_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_CC027E7F: Refreshing state... [id=cdktf-provider-github:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-github_repo_secret-twine-username_384E3E92: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.cdktf-provider-github_repo_secret-maven-password_C60B1509: Refreshing state... [id=cdktf-provider-github:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-github_repository-setup_automerge-label_425BE732: Refreshing state... [id=cdktf-provider-github:automerge]
github_actions_secret.cdktf-provider-github_repo_secret-maven-gpg-private-key_3F62DCB2: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY]
github_repository_dependabot_security_updates.cdktf-provider-github_dependabot-security_9067F5E0: Refreshing state... [id=cdktf-provider-github]
github_actions_secret.cdktf-provider-github_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_650E4100: Refreshing state... [id=cdktf-provider-github:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-github_repo_secret-maven-gpg-private-key-passphrase_A6FF60B0: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-aws_repo_secret-maven-gpg-private-key-passphrase_0B54C43A: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_repository_dependabot_security_updates.cdktf-provider-aws_dependabot-security_00C593BF: Refreshing state... [id=cdktf-provider-aws]
github_actions_secret.cdktf-provider-aws_repo_secret-maven-gpg-private-key_51ED4608: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY]
github_repository_webhook.cdktf-provider-aws_repository-setup_slack-webhook_67BC6278: Refreshing state... [id=387363109]
github_issue_label.cdktf-provider-aws_repository-setup_no-auto-close-label_2680211A: Refreshing state... [id=cdktf-provider-aws:no-auto-close]
github_actions_secret.cdktf-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3A7BDF5E: Refreshing state... [id=cdktf-provider-aws:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktf-provider-aws_repository-setup_automerge-label_54963B45: Refreshing state... [id=cdktf-provider-aws:automerge]
github_actions_secret.cdktf-provider-aws_repo_secret-gh-token_B92AC48E: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.cdktf-provider-aws_repo_secret-maven-username_17C580E4: Refreshing state... [id=cdktf-provider-aws:MAVEN_USERNAME]
github_branch_protection.cdktf-provider-aws_repository-setup_main-protection_3B3BA54A: Refreshing state... [id=BPR_kwDOERTEfs4B07w8]
github_actions_secret.cdktf-provider-aws_repo_secret-alert-prs-slack-webhook-url_29982F86: Refreshing state... [id=cdktf-provider-aws:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-aws_repo_secret-nuget-api-key_018820E1: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.cdktf-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8FD4ADB3: Refreshing state... [id=cdktf-provider-aws:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-aws_repository-setup_auto-approve-label_C725AB66: Refreshing state... [id=cdktf-provider-aws:auto-approve]
github_actions_secret.cdktf-provider-aws_repo_secret-maven-password_772F7705: Refreshing state... [id=cdktf-provider-aws:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-aws_repo_secret-twine-password_8F36B2EF: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-aws_repo_secret-npm-token_D2C104B7: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.cdktf-provider-aws_repo_secret-twine-username_3A9D3F13: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.cdktf-provider-aws_repo_secret-maven-staging-profile-id_B4409CFE: Refreshing state... [id=cdktf-provider-aws:MAVEN_STAGING_PROFILE_ID]
github_repository_webhook.cdktf-provider-datadog-go_repository-setup_slack-webhook_6460DE04: Refreshing state... [id=387362863]
github_issue_label.cdktf-provider-datadog-go_repository-setup_automerge-label_694FD7D6: Refreshing state... [id=cdktf-provider-datadog-go:automerge]
github_issue_label.cdktf-provider-datadog-go_repository-setup_no-auto-close-label_0E7F3997: Refreshing state... [id=cdktf-provider-datadog-go:no-auto-close]
github_issue_label.cdktf-provider-datadog-go_repository-setup_auto-approve-label_7889C221: Refreshing state... [id=cdktf-provider-datadog-go:auto-approve]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-twine-password_FC7F75B4: Refreshing state... [id=cdktf-provider-googlebeta:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-maven-staging-profile-id_F831BD1D: Refreshing state... [id=cdktf-provider-googlebeta:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-nuget-api-key_5BCC1FE6: Refreshing state... [id=cdktf-provider-googlebeta:NUGET_API_KEY]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-gh-token_AE0BA3DB: Refreshing state... [id=cdktf-provider-googlebeta:GH_TOKEN]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-maven-gpg-private-key-passphrase_440B423D: Refreshing state... [id=cdktf-provider-googlebeta:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-maven-username_EC4FBECE: Refreshing state... [id=cdktf-provider-googlebeta:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-maven-gpg-private-key_41371A6C: Refreshing state... [id=cdktf-provider-googlebeta:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-maven-password_B37FCB46: Refreshing state... [id=cdktf-provider-googlebeta:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-alert-prs-slack-webhook-url_87E5FDDC: Refreshing state... [id=cdktf-provider-googlebeta:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_webhook.cdktf-provider-googlebeta_repository-setup_slack-webhook_204A6036: Refreshing state... [id=387362453]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-npm-token_512ED2D3: Refreshing state... [id=cdktf-provider-googlebeta:NPM_TOKEN]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_028E47C5: Refreshing state... [id=cdktf-provider-googlebeta:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-googlebeta_repository-setup_auto-approve-label_007D7C98: Refreshing state... [id=cdktf-provider-googlebeta:auto-approve]
github_issue_label.cdktf-provider-googlebeta_repository-setup_no-auto-close-label_B9430392: Refreshing state... [id=cdktf-provider-googlebeta:no-auto-close]
github_branch_protection.cdktf-provider-googlebeta_repository-setup_main-protection_7F57E74C: Refreshing state... [id=BPR_kwDOHLN98M4B07u1]
github_repository_dependabot_security_updates.cdktf-provider-googlebeta_dependabot-security_4D0B27D5: Refreshing state... [id=cdktf-provider-googlebeta]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-twine-username_6F252D45: Refreshing state... [id=cdktf-provider-googlebeta:TWINE_USERNAME]
github_actions_secret.cdktf-provider-googlebeta_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_E8F64644: Refreshing state... [id=cdktf-provider-googlebeta:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktf-provider-googlebeta_repository-setup_automerge-label_18C058C6: Refreshing state... [id=cdktf-provider-googlebeta:automerge]
github_repository_webhook.cdktf-provider-tfe-go_repository-setup_slack-webhook_68778AD3: Refreshing state... [id=387363062]
github_issue_label.cdktf-provider-tfe-go_repository-setup_auto-approve-label_D65B322E: Refreshing state... [id=cdktf-provider-tfe-go:auto-approve]
github_issue_label.cdktf-provider-tfe-go_repository-setup_automerge-label_1EB182B6: Refreshing state... [id=cdktf-provider-tfe-go:automerge]
github_issue_label.cdktf-provider-tfe-go_repository-setup_no-auto-close-label_BC3F2432: Refreshing state... [id=cdktf-provider-tfe-go:no-auto-close]
github_issue_label.cdktf-provider-googlebeta-go_repository-setup_no-auto-close-label_B452B0AB: Refreshing state... [id=cdktf-provider-googlebeta-go:no-auto-close]
github_repository_webhook.cdktf-provider-googlebeta-go_repository-setup_slack-webhook_36409314: Refreshing state... [id=387362176]
github_issue_label.cdktf-provider-googlebeta-go_repository-setup_automerge-label_5C363E02: Refreshing state... [id=cdktf-provider-googlebeta-go:automerge]
github_issue_label.cdktf-provider-googlebeta-go_repository-setup_auto-approve-label_486DF896: Refreshing state... [id=cdktf-provider-googlebeta-go:auto-approve]
github_issue_label.cdktf-provider-github-go_repository-setup_auto-approve-label_A5963C91: Refreshing state... [id=cdktf-provider-github-go:auto-approve]
github_repository_webhook.cdktf-provider-github-go_repository-setup_slack-webhook_A86817CF: Refreshing state... [id=387363026]
github_issue_label.cdktf-provider-github-go_repository-setup_no-auto-close-label_FF7800EB: Refreshing state... [id=cdktf-provider-github-go:no-auto-close]
github_issue_label.cdktf-provider-github-go_repository-setup_automerge-label_0138114E: Refreshing state... [id=cdktf-provider-github-go:automerge]
github_issue_label.cdktf-provider-google-go_repository-setup_automerge-label_69192BBE: Refreshing state... [id=cdktf-provider-google-go:automerge]
github_repository_webhook.cdktf-provider-google-go_repository-setup_slack-webhook_AA771278: Refreshing state... [id=387362447]
github_issue_label.cdktf-provider-google-go_repository-setup_auto-approve-label_5D9530FD: Refreshing state... [id=cdktf-provider-google-go:auto-approve]
github_issue_label.cdktf-provider-google-go_repository-setup_no-auto-close-label_E4FCAD2E: Refreshing state... [id=cdktf-provider-google-go:no-auto-close]
github_actions_secret.cdktf-provider-datadog_repo_secret-maven-username_B230298C: Refreshing state... [id=cdktf-provider-datadog:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-datadog_repo_secret-twine-username_5964E5B8: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_actions_secret.cdktf-provider-datadog_repo_secret-maven-staging-profile-id_8B99250E: Refreshing state... [id=cdktf-provider-datadog:MAVEN_STAGING_PROFILE_ID]
github_repository_dependabot_security_updates.cdktf-provider-datadog_dependabot-security_8B8FA769: Refreshing state... [id=cdktf-provider-datadog]
github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B0CD4CDF: Refreshing state... [id=cdktf-provider-datadog:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-datadog_repo_secret-maven-gpg-private-key_CF14A31B: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-datadog_repo_secret-npm-token_6E86F6BF: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.cdktf-provider-datadog_repo_secret-twine-password_854C96D2: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_repository_webhook.cdktf-provider-datadog_repository-setup_slack-webhook_90EE0DE8: Refreshing state... [id=387362265]
github_actions_secret.cdktf-provider-datadog_repo_secret-alert-prs-slack-webhook-url_B7DC75BA: Refreshing state... [id=cdktf-provider-datadog:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-datadog_repository-setup_auto-approve-label_573BE0A1: Refreshing state... [id=cdktf-provider-datadog:auto-approve]
github_actions_secret.cdktf-provider-datadog_repo_secret-nuget-api-key_DF9FB246: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.cdktf-provider-datadog_repo_secret-maven-gpg-private-key-passphrase_384ABAF4: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-datadog_repository-setup_no-auto-close-label_11F230FF: Refreshing state... [id=cdktf-provider-datadog:no-auto-close]
github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3E1F5BD8: Refreshing state... [id=cdktf-provider-datadog:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktf-provider-datadog_repository-setup_automerge-label_C6032188: Refreshing state... [id=cdktf-provider-datadog:automerge]
github_actions_secret.cdktf-provider-datadog_repo_secret-maven-password_6424AEFF: Refreshing state... [id=cdktf-provider-datadog:MAVEN_PASSWORD]
github_branch_protection.cdktf-provider-datadog_repository-setup_main-protection_F8F82455: Refreshing state... [id=BPR_kwDOFkoFWc4B07wb]
github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token_2123096E: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.cdktf-provider-null_repo_secret-maven-username_9B95DC60: Refreshing state... [id=cdktf-provider-null:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-null_repo_secret-nuget-api-key_346434B9: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_repository_webhook.cdktf-provider-null_repository-setup_slack-webhook_1BB11A86: Refreshing state... [id=387362695]
github_actions_secret.cdktf-provider-null_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_0DC7B023: Refreshing state... [id=cdktf-provider-null:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-null_repo_secret-twine-username_1E557D4A: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.cdktf-provider-null_repo_secret-gh-token_FB623CEE: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.cdktf-provider-null_repo_secret-maven-staging-profile-id_6104CA26: Refreshing state... [id=cdktf-provider-null:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-null_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D67B5EB8: Refreshing state... [id=cdktf-provider-null:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-null_repository-setup_automerge-label_E7A89E15: Refreshing state... [id=cdktf-provider-null:automerge]
github_actions_secret.cdktf-provider-null_repo_secret-maven-gpg-private-key_1AE13CE3: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY]
github_repository_dependabot_security_updates.cdktf-provider-null_dependabot-security_011A8FA8: Refreshing state... [id=cdktf-provider-null]
github_actions_secret.cdktf-provider-null_repo_secret-maven-gpg-private-key-passphrase_712421B6: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-null_repository-setup_no-auto-close-label_C29EC1A7: Refreshing state... [id=cdktf-provider-null:no-auto-close]
github_branch_protection.cdktf-provider-null_repository-setup_main-protection_CC0445E1: Refreshing state... [id=BPR_kwDOERTQT84B07yg]
github_actions_secret.cdktf-provider-null_repo_secret-npm-token_AB9D0F7E: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_issue_label.cdktf-provider-null_repository-setup_auto-approve-label_0506E4B9: Refreshing state... [id=cdktf-provider-null:auto-approve]
github_actions_secret.cdktf-provider-null_repo_secret-alert-prs-slack-webhook-url_4A46B1C7: Refreshing state... [id=cdktf-provider-null:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-null_repo_secret-twine-password_ED6281FA: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-null_repo_secret-maven-password_A1C89E19: Refreshing state... [id=cdktf-provider-null:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-azurerm-go_repository-setup_no-auto-close-label_9E11626A: Refreshing state... [id=cdktf-provider-azurerm-go:no-auto-close]
github_issue_label.cdktf-provider-azurerm-go_repository-setup_auto-approve-label_F790DD20: Refreshing state... [id=cdktf-provider-azurerm-go:auto-approve]
github_issue_label.cdktf-provider-azurerm-go_repository-setup_automerge-label_120F5785: Refreshing state... [id=cdktf-provider-azurerm-go:automerge]
github_repository_webhook.cdktf-provider-azurerm-go_repository-setup_slack-webhook_C1427503: Refreshing state... [id=387362444]
github_actions_secret.cdktf-provider-vault_repo_secret-maven-password_0562E59D: Refreshing state... [id=cdktf-provider-vault:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-vault_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_7CABE498: Refreshing state... [id=cdktf-provider-vault:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-vault_repo_secret-maven-staging-profile-id_DF6228F5: Refreshing state... [id=cdktf-provider-vault:MAVEN_STAGING_PROFILE_ID]
github_repository_dependabot_security_updates.cdktf-provider-vault_dependabot-security_0AE5033F: Refreshing state... [id=cdktf-provider-vault]
github_actions_secret.cdktf-provider-vault_repo_secret-maven-gpg-private-key-passphrase_E0C089E6: Refreshing state... [id=cdktf-provider-vault:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_repository_webhook.cdktf-provider-vault_repository-setup_slack-webhook_ACE79B16: Refreshing state... [id=387362671]
github_actions_secret.cdktf-provider-vault_repo_secret-gh-token_50F44124: Refreshing state... [id=cdktf-provider-vault:GH_TOKEN]
github_actions_secret.cdktf-provider-vault_repo_secret-maven-username_5151B56F: Refreshing state... [id=cdktf-provider-vault:MAVEN_USERNAME]
github_issue_label.cdktf-provider-vault_repository-setup_no-auto-close-label_F0972269: Refreshing state... [id=cdktf-provider-vault:no-auto-close]
github_actions_secret.cdktf-provider-vault_repo_secret-npm-token_427C7E00: Refreshing state... [id=cdktf-provider-vault:NPM_TOKEN]
github_actions_secret.cdktf-provider-vault_repo_secret-twine-username_F3FFC69B: Refreshing state... [id=cdktf-provider-vault:TWINE_USERNAME]
github_actions_secret.cdktf-provider-vault_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_914A8DAA: Refreshing state... [id=cdktf-provider-vault:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-vault_repository-setup_automerge-label_D04019EA: Refreshing state... [id=cdktf-provider-vault:automerge]
github_actions_secret.cdktf-provider-vault_repo_secret-twine-password_27EA9423: Refreshing state... [id=cdktf-provider-vault:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-vault_repo_secret-alert-prs-slack-webhook-url_57CC23D6: Refreshing state... [id=cdktf-provider-vault:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-vault_repository-setup_auto-approve-label_7D0FCA1C: Refreshing state... [id=cdktf-provider-vault:auto-approve]
github_branch_protection.cdktf-provider-vault_repository-setup_main-protection_5A9C08E1: Refreshing state... [id=BPR_kwDOHji2js4B07ue]
github_actions_secret.cdktf-provider-vault_repo_secret-nuget-api-key_321F3FAD: Refreshing state... [id=cdktf-provider-vault:NUGET_API_KEY]
github_actions_secret.cdktf-provider-vault_repo_secret-maven-gpg-private-key_D259F38E: Refreshing state... [id=cdktf-provider-vault:MAVEN_GPG_PRIVATE_KEY]
github_team_repository.cdktf-provider-random_repository-setup_managing-team_EDED5EC3: Refreshing state... [id=6602018:cdktf-provider-random]
github_team_repository.cdktf-provider-vault_repository-setup_managing-team_4DB375C0: Refreshing state... [id=6602018:cdktf-provider-vault]
github_team_repository.cdktf-provider-random-go_repository-setup_managing-team_FB2179BB: Refreshing state... [id=6602018:cdktf-provider-random-go]
github_team_repository.cdktf-provider-aws_repository-setup_managing-team_D8B8AAB9: Refreshing state... [id=6602018:cdktf-provider-aws]
github_team_repository.cdktf-provider-aws-go_repository-setup_managing-team_B02B62B3: Refreshing state... [id=6602018:cdktf-provider-aws-go]
github_team_repository.cdktf-provider-vault-go_repository-setup_managing-team_43F1A886: Refreshing state... [id=6602018:cdktf-provider-vault-go]
github_team_repository.cdktf-provider-google-go_repository-setup_managing-team_F166D741: Refreshing state... [id=6602018:cdktf-provider-google-go]
github_team_repository.cdktf-provider-tfe_repository-setup_managing-team_A8198715: Refreshing state... [id=6602018:cdktf-provider-tfe]
github_team_repository.cdktf-provider-kubernetes_repository-setup_managing-team_2A6D926D: Refreshing state... [id=6602018:cdktf-provider-kubernetes]
github_team_repository.cdktf-provider-github-go_repository-setup_managing-team_1A525BC0: Refreshing state... [id=6602018:cdktf-provider-github-go]
github_team_repository.cdktf-provider-tfe-go_repository-setup_managing-team_CC1A3EA4: Refreshing state... [id=6602018:cdktf-provider-tfe-go]
github_team_repository.cdktf-provider-github_repository-setup_managing-team_D0C7328C: Refreshing state... [id=6602018:cdktf-provider-github]
github_team_repository.cdktf-provider-datadog-go_repository-setup_managing-team_2C0A2680: Refreshing state... [id=6602018:cdktf-provider-datadog-go]
github_team_repository.cdktf-provider-google_repository-setup_managing-team_96F5F779: Refreshing state... [id=6602018:cdktf-provider-google]
github_team_repository.cdktf-provider-null-go_repository-setup_managing-team_2D5DADE7: Refreshing state... [id=6602018:cdktf-provider-null-go]
github_team_repository.cdktf-provider-googlebeta-go_repository-setup_managing-team_3A606BB5: Refreshing state... [id=6602018:cdktf-provider-googlebeta-go]
github_team_repository.cdktf-provider-null_repository-setup_managing-team_E36EF5B8: Refreshing state... [id=6602018:cdktf-provider-null]
github_team_repository.cdktf-provider-azurerm-go_repository-setup_managing-team_91BD88F5: Refreshing state... [id=6602018:cdktf-provider-azurerm-go]
github_team_repository.cdktf-provider-project_repository-setup_managing-team_1CC282DE: Refreshing state... [id=6602018:cdktf-provider-project]
github_team_repository.cdktf-provider-datadog_repository-setup_managing-team_22881CDE: Refreshing state... [id=6602018:cdktf-provider-datadog]
github_team_repository.cdktf-repository-manager_repository-setup_managing-team_5A0C6472: Refreshing state... [id=6602018:cdktf-repository-manager]
github_team_repository.cdktf-provider-kubernetes-go_repository-setup_managing-team_BB6911C6: Refreshing state... [id=6602018:cdktf-provider-kubernetes-go]
github_team_repository.cdktf-provider-googlebeta_repository-setup_managing-team_0165B9EB: Refreshing state... [id=6602018:cdktf-provider-googlebeta]
github_team_repository.cdktf-provider-azurerm_repository-setup_managing-team_A7F18C7E: Refreshing state... [id=6602018:cdktf-provider-azurerm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-local_repo_secret-alert-prs-slack-webhook-url_227B2355 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-alert-prs-slack-webhook-url_227B2355" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_965A7020 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_965A7020" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_593FC050 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_593FC050" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-gh-token_412A128F will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-gh-token_412A128F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-maven-gpg-private-key-passphrase_34539A0D will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-maven-gpg-private-key-passphrase_34539A0D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-maven-gpg-private-key_8DCCFDA5 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-maven-gpg-private-key_8DCCFDA5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-maven-password_68FDD865 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-maven-password_68FDD865" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-maven-staging-profile-id_DDC7E09E will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-maven-staging-profile-id_DDC7E09E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-maven-username_222DBB16 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-maven-username_222DBB16" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-npm-token_9C647B4F will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-npm-token_9C647B4F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-nuget-api-key_F75700CA will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-nuget-api-key_F75700CA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-twine-password_FAE13DB1 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-twine-password_FAE13DB1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-twine-username_DAFD0608 will be created
  + resource "github_actions_secret" "cdktf-provider-local_repo_secret-twine-username_DAFD0608" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-repository-manager_repo_secret-gh-comment-token_D52FE846 will be created
  + resource "github_actions_secret" "cdktf-repository-manager_repo_secret-gh-comment-token_D52FE846" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-repository-manager"
      + secret_name     = "GH_COMMENT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktf-provider-local_repository-setup_main-protection_3E742716 will be created
  + resource "github_branch_protection" "cdktf-provider-local_repository-setup_main-protection_3E742716" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-provider-local"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktf-provider-local-go_repository-setup_auto-approve-label_0767D377 will be created
  + resource "github_issue_label" "cdktf-provider-local-go_repository-setup_auto-approve-label_0767D377" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local-go_repository-setup_automerge-label_F4A88465 will be created
  + resource "github_issue_label" "cdktf-provider-local-go_repository-setup_automerge-label_F4A88465" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local-go_repository-setup_no-auto-close-label_6E3FAE1E will be created
  + resource "github_issue_label" "cdktf-provider-local-go_repository-setup_no-auto-close-label_6E3FAE1E" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local_repository-setup_auto-approve-label_494C4887 will be created
  + resource "github_issue_label" "cdktf-provider-local_repository-setup_auto-approve-label_494C4887" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local_repository-setup_automerge-label_FB8345D6 will be created
  + resource "github_issue_label" "cdktf-provider-local_repository-setup_automerge-label_FB8345D6" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local_repository-setup_no-auto-close-label_B98F9DBE will be created
  + resource "github_issue_label" "cdktf-provider-local_repository-setup_no-auto-close-label_B98F9DBE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_repository.cdktf-provider-local-go_repo_D1C6CF46 will be created
  + resource "github_repository" "cdktf-provider-local-go_repo_D1C6CF46" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CDK for Terraform Go provider bindings for local."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktf-provider-local-go"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdktf",
          + "local",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.cdktf-provider-local_repo_4FEB5771 will be created
  + resource "github_repository" "cdktf-provider-local_repo_4FEB5771" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Prebuilt Terraform CDK (cdktf) provider for local."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktf-provider-local"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdktf",
          + "local",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_dependabot_security_updates.cdktf-provider-local_dependabot-security_77FCF19A will be created
  + resource "github_repository_dependabot_security_updates" "cdktf-provider-local_dependabot-security_77FCF19A" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktf-provider-local"
    }

  # github_repository_webhook.cdktf-provider-local-go_repository-setup_slack-webhook_A7452B8D will be created
  + resource "github_repository_webhook" "cdktf-provider-local-go_repository-setup_slack-webhook_A7452B8D" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktf-provider-local_repository-setup_slack-webhook_6BD2A83E will be created
  + resource "github_repository_webhook" "cdktf-provider-local_repository-setup_slack-webhook_6BD2A83E" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-local"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktf-provider-local-go_repository-setup_managing-team_521AF979 will be created
  + resource "github_team_repository" "cdktf-provider-local-go_repository-setup_managing-team_521AF979" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-local-go"
      + team_id    = "6602018"
    }

  # github_team_repository.cdktf-provider-local_repository-setup_managing-team_AD3E005D will be created
  + resource "github_team_repository" "cdktf-provider-local_repository-setup_managing-team_AD3E005D" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-local"
      + team_id    = "6602018"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (6 unchanged elements hidden)
        "github_repository.cdktf-provider-kubernetes_repo_4B9B31BD.ssh_clone_url",
      + "github_repository.cdktf-provider-local_repo_4FEB5771.ssh_clone_url",
        "github_repository.cdktf-provider-null_repo_11F23BAB.ssh_clone_url",
        # (3 unchanged elements hidden)
    ]

```

</details>

*Pusher: @team-tf-cdk, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*